DataProcessors/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СИЗРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СИЗРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДействияСНормамиВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСНормамиВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РабочиеМестаОхраныТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеРабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредныеФакторыСопоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормыСИЗСоответствуютДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальноеРабочееМестоДляИнвалидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СредстваИндивидуальнойЗащиты/Forms/ИзменениеНормВыдачиРабочихМест/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") И ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		Подразделение = Параметры.Подразделение;
	КонецЕсли;
	
	Если Параметры.Свойство("РабочиеМеста") Тогда
		Для Каждого РабочееМесто Из Параметры.РабочиеМеста Цикл
			ПодобранныеРабочиеМеста.Добавить(РабочееМесто);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьРабочиеМестаИСИЗ(Истина);
	ПриПолученииДанныхНаСервере();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьПередЗакрытием", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗарплатаКадрыРасширенныйКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗарплатаКадрыРасширенныйКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеМеста

&НаКлиенте
Процедура РабочиеМестаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиПодбораНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РабочиеМестаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РабочиеМестаОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНормыВыдачиСИЗРабочегоМеста

&НаКлиенте
Процедура НормыВыдачиСИЗРабочегоМестаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЗаполнитьТаблицуДаннымиСИЗ(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСИЗРабочегоМестаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.НормыВыдачиСИЗРабочегоМеста.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.Добавить") Тогда
		НормыВыдачиСИЗРабочегоМеста.Удалить(НормыВыдачиСИЗРабочегоМеста.Индекс(ТекущиеДанные));
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.Удалить") Тогда
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.ПустаяСсылка");
	Иначе 
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.Удалить");
	КонецЕсли;
	
	ОформитьКомандуУдаления(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСИЗРабочегоМестаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НормыВыдачиСИЗРабочегоМеста.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОформитьКомандуУдаления(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьИЗакрытьНаКлиенте(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаКлиенте(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда) Экспорт
	
	ОчиститьСообщения();
	ЗаполнитьРабочиеМестаИСИЗ(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРабочихМест(Команда)
	
	ПараметрыОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыОтбора.Вставить("Владелец", Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПараметрыОтбора.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхРабочихМест());
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаВыбора", ПараметрыФормы, Элементы.РабочиеМеста);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСИЗ(Команда)
	НачатьПодборСИЗ();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСИЗВсемРабочимМестам(Команда)
	
	ПодборДляУдаления = Ложь;
	НачатьПодборСИЗДляВсехРабочихМест();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСИЗУВсехРабочихМест(Команда)
	
	ПодборДляУдаления = Истина;
	НачатьПодборСИЗДляВсехРабочихМест();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЖирныйШрифтБЭД);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "НормыВыдачиСИЗРабочегоМеста.Действие", Перечисления.ДействияСНормамиВыдачиСИЗ.Добавить);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗРабочегоМеста.Имя);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ВажныеДанныеЦветБЭД);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗачеркнутыйШрифтБЭД);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "НормыВыдачиСИЗРабочегоМеста.Действие", Перечисления.ДействияСНормамиВыдачиСИЗ.Удалить);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗРабочегоМеста.Имя);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЖирныйШрифтБЭД);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "НормыВыдачиСИЗРабочегоМеста.Действие", Перечисления.ДействияСНормамиВыдачиСИЗ.Изменить);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗРабочегоМеста.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиПодбораНаКлиенте()
	
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		НормыВыдачиСИЗРабочегоМеста.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНормыВыдачиСИЗРабочегоМеста(ТекущиеДанные.РабочееМесто);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНормыВыдачиСИЗРабочегоМеста(РабочееМесто)
	
	Если РабочееМесто = РабочееМестоПредыдущее Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНормыВыдачиПредыдущегоРабочегоМеста(ЭтотОбъект);
	НормыВыдачиСИЗРабочегоМеста.Очистить();
	
	НайденныеСтрокиСИЗ = НормыВыдачиСИЗ.НайтиСтроки(Новый Структура("РабочееМесто", РабочееМесто));
	
	Для Каждого СтрокаСИЗ Из НайденныеСтрокиСИЗ Цикл
		НоваяСтрока = НормыВыдачиСИЗРабочегоМеста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСИЗ);
	КонецЦикла;
	
	РабочееМестоПредыдущее = РабочееМесто;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьНормыВыдачиПредыдущегоРабочегоМеста(Форма)
	
	Если Форма.РабочееМестоПредыдущее = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтрокиСИЗ = Форма.НормыВыдачиСИЗ.НайтиСтроки(Новый Структура("РабочееМесто", Форма.РабочееМестоПредыдущее));
	ТекущийИндекс = НайденныеСтрокиСИЗ.ВГраница();
	Пока ТекущийИндекс >= 0 Цикл
		Форма.НормыВыдачиСИЗ.Удалить(Форма.НормыВыдачиСИЗ.Индекс(НайденныеСтрокиСИЗ[ТекущийИндекс]));
		ТекущийИндекс = ТекущийИндекс - 1;
	КонецЦикла;
	Для Каждого СтрокаСИЗ Из Форма.НормыВыдачиСИЗРабочегоМеста Цикл
		ЗаполнитьЗначенияСвойств(Форма.НормыВыдачиСИЗ.Добавить(), СтрокаСИЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РабочиеМестаОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ВыбранныеЗначения = ВыбранноеЗначение;
	Иначе
		ВыбранныеЗначения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	Если ТипЗнч(ВыбранныеЗначения[0]) = Тип("СправочникСсылка.РабочиеМестаОхраныТруда") Тогда
		Для Каждого РабочееМесто Из ВыбранныеЗначения Цикл
			ПодобранныеРабочиеМеста.Добавить(РабочееМесто);
		КонецЦикла;
		ЗаполнитьРабочиеМестаИСИЗ(Истина, ВыбранныеЗначения);
	ИначеЕсли ТипЗнч(ВыбранныеЗначения[0]) = Тип("СправочникСсылка.СредстваИндивидуальнойЗащиты") Тогда
		Если ПодборДляУдаления Тогда
			УдалитьСИЗДляВсехРабочихМест(ВыбранныеЗначения);
		Иначе
			ЗаполнитьТаблицуДаннымиСИЗДляВсехРабочихМест(ВыбранныеЗначения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРабочиеМестаИСИЗ(ИспользоватьОтбор, ОтборРабочихМест = Неопределено)
	
	Если ИспользоватьОтбор Тогда
		Если ОтборРабочихМест = Неопределено Тогда
			ОтборРабочихМест = ПодобранныеРабочиеМеста.ВыгрузитьЗначения();
		КонецЕсли;
		Для Каждого РабочееМесто Из ОтборРабочихМест Цикл
			Отбор = Новый Структура("РабочееМесто", РабочееМесто);
			НайденныеСтроки = РабочиеМеста.НайтиСтроки(Отбор);
			ТекущийИндекс = НайденныеСтроки.ВГраница();
			Пока ТекущийИндекс >= 0 Цикл
				РабочиеМеста.Удалить(РабочиеМеста.Индекс(НайденныеСтроки[ТекущийИндекс]));
				ТекущийИндекс = ТекущийИндекс - 1;
			КонецЦикла;
			НайденныеСтроки = НормыВыдачиСИЗ.НайтиСтроки(Отбор);
			ТекущийИндекс = НайденныеСтроки.ВГраница();
			Пока ТекущийИндекс >= 0 Цикл
				НормыВыдачиСИЗ.Удалить(НормыВыдачиСИЗ.Индекс(НайденныеСтроки[ТекущийИндекс]));
				ТекущийИндекс = ТекущийИндекс - 1;
			КонецЦикла;
		КонецЦикла;
	Иначе
		ОчиститьТаблицыФормы();
	КонецЕсли;
	
	РезультатыПакетаЗапросов = СредстваИндивидуальнойЗащитыФормы.РезультатыПакетаЗапросовДляИзмененияНормВыдачиРабочихМест(
		ЭтотОбъект, ИспользоватьОтбор, ОтборРабочихМест);
	
	ВыборкаДетальныеЗаписи = РезультатыПакетаЗапросов[0].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РабочиеМеста.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = РезультатыПакетаЗапросов[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = НормыВыдачиСИЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		ЗаполнитьКомандуПериодичность(НоваяСтрока);
	КонецЦикла;
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицыФормы()
	
	РабочиеМеста.Очистить();
	НормыВыдачиСИЗ.Очистить();
	НормыВыдачиСИЗРабочегоМеста.Очистить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКомандуПериодичность(НоваяСтрока)
	
	НоваяСтрока.КомандаПериодичность = ПредставлениеПериодичности(
		НоваяСтрока.КратностьВыдачи, НоваяСтрока.ПериодичностьВыдачи, НоваяСтрока.ЕдиницаПериодичностиВыдачи, НоваяСтрока.СпособВыдачи);
	
	Если НоваяСтрока.Дежурное Тогда
		Если НоваяСтрока.КомандаПериодичность = "" Тогда
			НоваяСтрока.КомандаПериодичность = НСтр("ru='Дежурное'");
		Иначе
			НоваяСтрока.КомандаПериодичность = НоваяСтрока.КомандаПериодичность + " - " + НСтр("ru='дежурное'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПериодичности(Кратность, Периодичность, ЕдиницаПериодичности, СпособВыдачи)
	
	ПредставлениеПериодичности = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
		Кратность, Периодичность, ЕдиницаПериодичности, , , СпособВыдачи);
	Если Не ЗначениеЗаполнено(ПредставлениеПериодичности) Тогда
		Возврат НСтр("ru = '< Не установлена >'");
	КонецЕсли;
	
	Возврат ПредставлениеПериодичности;
	
КонецФункции

#Область КлючевыеРеквизитыЗаполненияФормы

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
// 
// Возвращаемое значение:
//  Массив Из Строка - Ключевые реквизиты заполнения формы описание ключевых реквизитов
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("РабочиеМеста");
	ИменаТаблиц.Добавить("НормыВыдачиСИЗ");
	
	Возврат ИменаТаблиц;
	
КонецФункции 

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
// 
// Возвращаемое значение:
//  Массив Из Структура - Ключевые реквизиты заполнения формы описание ключевых реквизитов
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	ОписанияРеквизитов = Новый Массив;
	ОписанияРеквизитов.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация",	НСтр("ru = 'организации'")));
	ОписанияРеквизитов.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", НСтр("ru = 'подразделения'")));
	
	Возврат ОписанияРеквизитов;
	
КонецФункции

#КонецОбласти

&НаСервере
Функция АдресСпискаПодобранныхРабочихМест()
	
	Возврат ПоместитьВоВременноеХранилище(
		РабочиеМеста.Выгрузить(,"РабочееМесто").ВыгрузитьКолонку("РабочееМесто"), УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура НачатьПодборСИЗ()

	ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор, АдресПодобранных");
	ПараметрыФормы.РежимВыбора = Истина;
	ПараметрыФормы.МножественныйВыбор = Истина;
	ПараметрыФормы.АдресПодобранных = АдресПодобранныхСИЗ();
	
	ОткрытьФорму("Справочник.СредстваИндивидуальнойЗащиты.ФормаВыбора", ПараметрыФормы, Элементы.НормыВыдачиСИЗРабочегоМеста);

КонецПроцедуры

&НаСервере
Функция АдресПодобранныхСИЗ()
	Возврат ПоместитьВоВременноеХранилище(НормыВыдачиСИЗРабочегоМеста.Выгрузить(, "СИЗ").ВыгрузитьКолонку("СИЗ"));
КонецФункции

&НаКлиенте
Процедура НачатьПодборСИЗДляВсехРабочихМест()

	СохранитьНормыВыдачиПредыдущегоРабочегоМеста(ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор");
	ПараметрыФормы.РежимВыбора = Истина;
	ПараметрыФормы.МножественныйВыбор = Истина;
	
	Если ПодборДляУдаления Тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура);
		ПараметрыФормы.Отбор.Вставить("Ссылка", ОтборСИЗ());
	Иначе
		ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхСИЗДляВсехРабочихМест());
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СредстваИндивидуальнойЗащиты.ФормаВыбора", ПараметрыФормы, Элементы.РабочиеМеста);

КонецПроцедуры

&НаСервере
Функция АдресПодобранныхСИЗДляВсехРабочихМест()
	
	РабочиеМестаСИЗ = Новый Соответствие;
	Для Каждого СтрокаНорм Из НормыВыдачиСИЗ Цикл
		Если СтрокаНорм.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.Удалить") Тогда
			Продолжить;
		КонецЕсли;
		КоличествоРабочихМестПоСИЗ = РабочиеМестаСИЗ.Получить(СтрокаНорм.СИЗ);
		Если КоличествоРабочихМестПоСИЗ = Неопределено Тогда
			КоличествоРабочихМестПоСИЗ = 0;
		КонецЕсли;
		РабочиеМестаСИЗ.Вставить(СтрокаНорм.СИЗ, КоличествоРабочихМестПоСИЗ + 1);
	КонецЦикла;
	
	КоличествоРабочихМест = РабочиеМеста.Количество();
	
	ПодобранныеСИЗ = Новый Массив;
	Для Каждого КлючИЗначение Из РабочиеМестаСИЗ Цикл
		Если КлючИЗначение.Значение < КоличествоРабочихМест Тогда
			Продолжить;
		КонецЕсли;
		ПодобранныеСИЗ.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПодобранныеСИЗ);
	
КонецФункции

&НаСервере
Функция ОтборСИЗ()
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(НормыВыдачиСИЗ.Выгрузить(, "СИЗ").ВыгрузитьКолонку("СИЗ"));
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуДаннымиСИЗ(ВыбранноеЗначение)
	
	ДанныеСИЗ = ДанныеСИЗ(ВыбранноеЗначение);
	Для Каждого Значение Из ВыбранноеЗначение Цикл
		НоваяСтрока = НормыВыдачиСИЗРабочегоМеста.Добавить();
		НоваяСтрока.СИЗ = Значение;
		ЗначенияРеквизитовСИЗ = ДанныеСИЗ.Получить(Значение);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияРеквизитовСИЗ);
		НоваяСтрока.Количество = ЗначенияРеквизитовСИЗ.КоличествоПоУмолчанию;
		ЗаполнитьКомандуПериодичность(НоваяСтрока);
		НоваяСтрока.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.Добавить;
		НоваяСтрока.РабочееМесто = РабочееМестоПредыдущее;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДаннымиСИЗДляВсехРабочихМест(ВыбранныеЗначения)
	
	ДанныеСИЗ = ДанныеСИЗ(ВыбранныеЗначения);
	Для Каждого Значение Из ВыбранныеЗначения Цикл
		ЗначенияРеквизитовСИЗ = ДанныеСИЗ.Получить(Значение);
		Для Каждого СтрокаРабочееМесто Из РабочиеМеста Цикл
			ДобавитьСИЗРабочмемуМесту(СтрокаРабочееМесто.РабочееМесто, ЗначенияРеквизитовСИЗ, Значение);
		КонецЦикла;
		ДобавитьСИЗРабочмемуМесту(РабочееМестоПредыдущее, ЗначенияРеквизитовСИЗ, Значение, "НормыВыдачиСИЗРабочегоМеста");
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УдалитьСИЗДляВсехРабочихМест(ВыбранныеЗначения)
	
	Для Каждого Значение Из ВыбранныеЗначения Цикл
		НайденныеСтрокиСИЗ = НормыВыдачиСИЗ.НайтиСтроки(Новый Структура("СИЗ", Значение));
		ТекущийИндекс = НайденныеСтрокиСИЗ.ВГраница();
		Пока ТекущийИндекс >= 0 Цикл
			НайденнаяСтрока = НайденныеСтрокиСИЗ[ТекущийИндекс];
			Если НайденнаяСтрока.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.Добавить Тогда
				НормыВыдачиСИЗ.Удалить(НормыВыдачиСИЗ.Индекс(НайденнаяСтрока));
			Иначе
				НайденнаяСтрока.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.Удалить;
			КонецЕсли;
			ТекущийИндекс = ТекущийИндекс - 1;
		КонецЦикла;
	КонецЦикла;
	
	НормыВыдачиСИЗРабочегоМеста.Очистить();
	
	НайденныеСтрокиСИЗ = НормыВыдачиСИЗ.НайтиСтроки(Новый Структура("РабочееМесто", РабочееМестоПредыдущее));
	
	Для Каждого СтрокаСИЗ Из НайденныеСтрокиСИЗ Цикл
		НоваяСтрока = НормыВыдачиСИЗРабочегоМеста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСИЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСИЗРабочмемуМесту(РабочееМесто, ЗначенияРеквизитовСИЗ, СИЗ, ИмяТаблицы = "НормыВыдачиСИЗ")
	
	НайденныеСтрокиСИЗ = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(
		Новый Структура("РабочееМесто, СИЗ", РабочееМесто, СИЗ));
	Если НайденныеСтрокиСИЗ.Количество() = 0 Тогда
		НоваяСтрока = ЭтотОбъект[ИмяТаблицы].Добавить();
		НоваяСтрока.СИЗ = СИЗ;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияРеквизитовСИЗ);
		НоваяСтрока.Количество = ЗначенияРеквизитовСИЗ.КоличествоПоУмолчанию;
		ЗаполнитьКомандуПериодичность(НоваяСтрока);
		НоваяСтрока.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.Добавить;
		НоваяСтрока.РабочееМесто = РабочееМесто;
	Иначе
		СтрокаСИЗ = НайденныеСтрокиСИЗ[0];
		Если СтрокаСИЗ.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.Удалить Тогда
			СтрокаСИЗ.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеСИЗ(СИЗ)
	
	Если Не ЗначениеЗаполнено(СИЗ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СИЗ,
		"ТипНоменклатуры,
		|СпособВыдачи,
		|КоличествоПоУмолчанию,
		|ЕдиницаИзмерения,
		|КратностьВыдачи,
		|ПериодичностьВыдачи,
		|ЕдиницаПериодичностиВыдачи");
	
КонецФункции

&НаКлиенте
Процедура ОформитьКомандуУдаления(ТекущиеДанные)
	
	КнопкаУдалить = Элементы.НормыВыдачиСИЗРабочегоМестаУдалить;
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.Добавить") Тогда
		КнопкаУдалить.Заголовок = НСтр("ru = 'Удалить'");
		КнопкаУдалить.Картинка = БиблиотекаКартинок.Удалить;
		КнопкаУдалить.Видимость = Истина;
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНормамиВыдачиСИЗ.Удалить") Тогда
		КнопкаУдалить.Заголовок = НСтр("ru = 'Отменить удаление'");
		КнопкаУдалить.Картинка = БиблиотекаКартинок.ОперацияВыполненаУспешно;
		КнопкаУдалить.Видимость = Истина;
	Иначе
		КнопкаУдалить.Заголовок = НСтр("ru = 'Пометить на удаление'");
		КнопкаУдалить.Картинка = БиблиотекаКартинок.Удалить;
		КнопкаУдалить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт 
	ЗаписатьИЗакрытьНаКлиенте(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНормыВыдачиСИЗ()
	
	СохранитьНормыВыдачиПредыдущегоРабочегоМеста(ЭтотОбъект);
	
	Для Каждого СтрокаРабочееМесто Из РабочиеМеста Цикл 
		НайденныеСтрокиСИЗ = НормыВыдачиСИЗ.НайтиСтроки(Новый Структура("РабочееМесто", СтрокаРабочееМесто.РабочееМесто));
		
		НаборЗаписей = РегистрыСведений.СИЗРабочегоМеста.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаРабочееМесто.РабочееМесто);
		
		Для Каждого СтрокаСИЗ Из НайденныеСтрокиСИЗ Цикл
			Если СтрокаСИЗ.Действие = Перечисления.ДействияСНормамиВыдачиСИЗ.Удалить Тогда
				Продолжить;
			КонецЕсли;
			СтрокаНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаСИЗ);
			СтрокаНабора["ПредставлениеПериодичностиВыдачи"] = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
				СтрокаНабора.КратностьВыдачи, СтрокаНабора.ПериодичностьВыдачи, СтрокаНабора.ЕдиницаПериодичностиВыдачи,
				СтрокаНабора.ЕдиницаИзмерения, СтрокаНабора.Количество, СтрокаНабора.СпособВыдачи);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Модифицированность = Ложь;
	
	РабочееМестоПредыдущее = Неопределено;
	ОчиститьТаблицыФормы();
	ЗаполнитьРабочиеМестаИСИЗ(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(ЗакрытьФорму) 
	
	ЗаписатьНормыВыдачиСИЗ();
	Оповестить("Запись_РабочиеМестаОхраныТруда", , ВладелецФормы);
	Если ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
